app/controllers/users_controller.rb

    def create
      user = User.new
      user.username = params["username"]
      user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Eryk"], ["created_at", "2021-01-15 16:58:47.775066"], ["updated_at", "2021-01-15 16:58:47.775066"]]

    def destroy
      user = User.find params["user_id"]
      user.destroy!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]

    def main
      @users = User.all.order(:created_at)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" ASC